crd-ws-deploy/crda-impl/src/test/resources/data/CGW/failling_pullConsumerCreditReport

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header/>
	<S:Body>
		<ns3:pullConsumerCreditReport xmlns:ns10="http://xmlschema.tmi.telus.com/xsd/common/exceptions/Exceptions_v1_0" xmlns:ns11="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/types/ping_v1" xmlns:ns2="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:ns3="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/CreditGatewayServiceRequestResponse_v1" xmlns:ns4="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/EnterpriseCommonTypes_v3" xmlns:ns5="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CreditGatewayRequestTypes_v1" xmlns:ns6="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CustomerManagementCommonTypes_v4" xmlns:ns7="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/customer_information_reference_types_1_0" xmlns:ns8="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2" xmlns:ns9="http://schemas.telus.com/eca/common_types_2_1">
			<ns3:auditInfo>
				<ns4:userId>123</ns4:userId>
				<ns4:salesRepresentativeId>123</ns4:salesRepresentativeId>
				<ns4:channelOrganizationId>123</ns4:channelOrganizationId>
				<ns4:outletId>123</ns4:outletId>
				<ns4:originatorApplicationId>123</ns4:originatorApplicationId>
				<ns4:correlationId>123</ns4:correlationId>
				<ns4:timestamp>2001-12-17T09:30:47Z</ns4:timestamp>
			</ns3:auditInfo>
			<ns3:consumerCreditReportRequest>
				<ns5:customerRequestId>22190490</ns5:customerRequestId>
				<ns5:language>EN</ns5:language>
				<ns5:referenceId>2768</ns5:referenceId>
				<ns5:referenceIdType>CARID</ns5:referenceIdType>
				<ns5:externalServiceProvider/>
				<ns5:creditCustomerInfo>
					<ns2:customerID>22190490</ns2:customerID>
					<ns2:personName>
						<ns2:firstName>Jonathan</ns2:firstName>
						<ns2:lastName>Tiu</ns2:lastName>
						<ns2:title>MR</ns2:title>
					</ns2:personName>
					<ns2:customerCreationDate>2013-02-20Z</ns2:customerCreationDate>
					<ns2:customerMasterSourceID>1012</ns2:customerMasterSourceID>
					<ns2:customerStatusCd>AC</ns2:customerStatusCd>
					<ns2:customerTypeCd>R</ns2:customerTypeCd>
					<ns2:customerSubTypeCd>I</ns2:customerSubTypeCd>
					<ns2:revenueSegmentCd>C1</ns2:revenueSegmentCd>
					<ns2:employeeInd>true</ns2:employeeInd>
				</ns5:creditCustomerInfo>
				<ns5:personalInfo>
					<ns2:employmentStatusCd>EM</ns2:employmentStatusCd>
					<ns2:residencyCd>O</ns2:residencyCd>
					<ns2:creditCheckConsentCd>Y</ns2:creditCheckConsentCd>
					<ns2:birthDate>1978-08-29Z</ns2:birthDate>
					<ns2:underLegalCareCd>N</ns2:underLegalCareCd>
				</ns5:personalInfo>
				<ns5:creditIdentification>
					<ns2:driverLicense/>
				</ns5:creditIdentification>
				<ns5:creditAddress>
					<ns2:creditAddressTypeCd>CB</ns2:creditAddressTypeCd>
					<ns2:addressTypeCd>CB</ns2:addressTypeCd>
					<ns2:addressLineOne>3777 Kingsway</ns2:addressLineOne>
					<ns2:cityName>Burnaby</ns2:cityName>
					<ns2:provinceCd>BC</ns2:provinceCd>
					<ns2:countryCd>CAN</ns2:countryCd>
					<ns2:postalCd>V5H3Z7</ns2:postalCd>
				</ns5:creditAddress>
				<ns5:lineOfBusiness>WIRELINE</ns5:lineOfBusiness>
				<ns5:channelId>123</ns5:channelId>
				<ns5:applicationProvinceCode>BC</ns5:applicationProvinceCode>
				<ns5:failOverIndicator>false</ns5:failOverIndicator>
			</ns3:consumerCreditReportRequest>
		</ns3:pullConsumerCreditReport>
	</S:Body>
</S:Envelope>
