crd-ws-deploy/crda-impl/src/test/resources/data/CGW/pullConsumerReportRequest.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header/>
	<S:Body>

<tns:pullConsumerCreditReport xmlns:tns="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/CreditGatewayServiceRequestResponse_v1"
	xsi:schemaLocation="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/CreditGatewayServiceRequestResponse_v1 CreditGatewayServiceRequestResponse_v1_2.xsd" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 	 
	xmlns:crdc="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" 
	xmlns:cgr="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CreditGatewayRequestTypes_v1" 
	xmlns:cmc="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CustomerManagementCommonTypes_v4" 
	xmlns:ect="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/EnterpriseCommonTypes_v3">
	<tns:auditInfo>
		<ect:userId>123</ect:userId>
		<ect:salesRepresentativeId>123</ect:salesRepresentativeId>
		<ect:channelOrganizationId>123</ect:channelOrganizationId>
		<ect:outletId>123</ect:outletId>
		<ect:originatorApplicationId>123</ect:originatorApplicationId>
		<ect:correlationId>123</ect:correlationId>
		<ect:timestamp>2001-12-17T09:30:47.0Z</ect:timestamp>
	</tns:auditInfo>
	<tns:consumerCreditReportRequest>
		<cgr:brandId>1</cgr:brandId>
		<cgr:customerRequestId>123</cgr:customerRequestId>
		<cgr:language>123</cgr:language>
		<cgr:referenceId>123</cgr:referenceId>
		<cgr:referenceIdType>123</cgr:referenceIdType>
		<cgr:externalServiceProvider>
			<cgr:primaryProvider>EQFXIC</cgr:primaryProvider>
			<cgr:secondaryProvider>EQFXIC</cgr:secondaryProvider>
		</cgr:externalServiceProvider>
		<cgr:creditCustomerInfo>
			<crdc:customerID>2147483647</crdc:customerID>
			<crdc:personName>
				<crdc:firstName>123</crdc:firstName>
				<crdc:lastName>123</crdc:lastName>
				<crdc:middleName>123</crdc:middleName>
				<crdc:nameSuffix>123</crdc:nameSuffix>
				<crdc:title>123</crdc:title>
			</crdc:personName>
			<crdc:customerCreationDate>1967-08-13</crdc:customerCreationDate>
			<crdc:customerMasterSourceID>2147483647</crdc:customerMasterSourceID>
			<crdc:customerStatusCd>123</crdc:customerStatusCd>
			<crdc:customerTypeCd>123</crdc:customerTypeCd>
			<crdc:customerSubTypeCd>123</crdc:customerSubTypeCd>
			<crdc:telecomContactList>
				<telecomContactId>2147483647</telecomContactId>
				<telecomContactTypeCode>123</telecomContactTypeCode>
				<telecomContactSubTypeCode>123</telecomContactSubTypeCode>
				<telephoneNumber>6043172234</telephoneNumber>
				<telephoneExtensionNumber>123</telephoneExtensionNumber>
				<lastUpdate>1967-08-13</lastUpdate>
			</crdc:telecomContactList>
			<crdc:telecomContactList>
				<telecomContactId>2147483647</telecomContactId>
				<telecomContactTypeCode>123</telecomContactTypeCode>
				<telecomContactSubTypeCode>123</telecomContactSubTypeCode>
				<telephoneNumber>6043172234</telephoneNumber>
				<telephoneExtensionNumber>123</telephoneExtensionNumber>
				<lastUpdate>1967-08-13</lastUpdate>
			</crdc:telecomContactList>
			<crdc:revenueSegmentCd>123</crdc:revenueSegmentCd>
			<crdc:employeeInd>true</crdc:employeeInd>
		</cgr:creditCustomerInfo>
		<cgr:personalInfo>
			<crdc:employmentStatusCd>123</crdc:employmentStatusCd>
			<crdc:residencyCd>123</crdc:residencyCd>
			<crdc:creditCheckConsentCd>Y</crdc:creditCheckConsentCd>
			<crdc:birthDate>1967-08-13</crdc:birthDate>
			<crdc:underLegalCareCd>N</crdc:underLegalCareCd>
			<crdc:provinceOfCurrentResidenceCd>BC</crdc:provinceOfCurrentResidenceCd>
		</cgr:personalInfo>
		<cgr:creditIdentification>
		</cgr:creditIdentification>
		<cgr:creditAddress>
			<crdc:creditAddressTypeCd>CB</crdc:creditAddressTypeCd>
			<crdc:addressTypeCd>123</crdc:addressTypeCd>
			<crdc:addressLineOne>123</crdc:addressLineOne>
			<crdc:addressLineTwo>123</crdc:addressLineTwo>
			<crdc:addressLineThree>123</crdc:addressLineThree>
			<crdc:addressLineFour>123</crdc:addressLineFour>
			<crdc:addressLineFive>123</crdc:addressLineFive>
			<crdc:cityName>Vancouver</crdc:cityName>
			<crdc:provinceCd>BC</crdc:provinceCd>
			<crdc:countryCd>CAN</crdc:countryCd>
			<crdc:postalCd>v3j7v5</crdc:postalCd>
		</cgr:creditAddress>
		<cgr:employerName>123</cgr:employerName>
		<cgr:occupation>123</cgr:occupation>
		<cgr:creditCard>
			<cmc:token>123</cmc:token>
			<cmc:first6>123</cmc:first6>
			<cmc:last4>123</cmc:last4>
			<cmc:expiryMonth>1</cmc:expiryMonth>
			<cmc:expiryYear>0</cmc:expiryYear>
			<cmc:cardVerificationData>123</cmc:cardVerificationData>
			<cmc:holderName>123</cmc:holderName>
		</cgr:creditCard>
		<cgr:lineOfBusiness>WIRELINE</cgr:lineOfBusiness>
		<cgr:channelId>123</cgr:channelId>
		<cgr:applicationProvinceCode>BC</cgr:applicationProvinceCode>
		<cgr:failOverIndicator>true</cgr:failOverIndicator>
	</tns:consumerCreditReportRequest>
</tns:pullConsumerCreditReport>
 
	</S:Body>
</S:Envelope>
